results/data/benchclient1/quarkus-io-thread-40000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.157ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.132ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.147ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.142ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  493.93us   3.96ms   62.96%
    Req/Sec    10.54k   694.66    13.67k    76.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%    1.52ms
 90.000%    1.80ms
 99.000%    2.22ms
 99.900%    2.58ms
 99.990%    2.87ms
 99.999%    3.18ms
100.000%    3.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.066     0.000000            1         1.00
       0.484     0.100000       199875         1.11
       0.664     0.200000       400073         1.25
       0.819     0.300000       599132         1.43
       0.961     0.400000       798327         1.67
       1.106     0.500000       997551         2.00
       1.183     0.550000      1097797         2.22
       1.263     0.600000      1197400         2.50
       1.346     0.650000      1296826         2.86
       1.431     0.700000      1396935         3.33
       1.517     0.750000      1496730         4.00
       1.559     0.775000      1546314         4.44
       1.602     0.800000      1596228         5.00
       1.647     0.825000      1646470         5.71
       1.694     0.850000      1696032         6.67
       1.745     0.875000      1746111         8.00
       1.772     0.887500      1770863         8.89
       1.801     0.900000      1795811        10.00
       1.832     0.912500      1820984        11.43
       1.866     0.925000      1845822        13.33
       1.903     0.937500      1870410        16.00
       1.924     0.943750      1882916        17.78
       1.947     0.950000      1895447        20.00
       1.972     0.956250      1908020        22.86
       2.000     0.962500      1920421        26.67
       2.032     0.968750      1932791        32.00
       2.051     0.971875      1939319        35.56
       2.071     0.975000      1945433        40.00
       2.093     0.978125      1951562        45.71
       2.119     0.981250      1957687        53.33
       2.151     0.984375      1964091        64.00
       2.167     0.985938      1966902        71.11
       2.187     0.987500      1970065        80.00
       2.209     0.989062      1973102        91.43
       2.237     0.990625      1976415       106.67
       2.267     0.992188      1979435       128.00
       2.285     0.992969      1980964       142.22
       2.305     0.993750      1982592       160.00
       2.327     0.994531      1984141       182.86
       2.351     0.995313      1985634       213.33
       2.379     0.996094      1987152       256.00
       2.397     0.996484      1988023       284.44
       2.415     0.996875      1988747       320.00
       2.435     0.997266      1989526       365.71
       2.459     0.997656      1990302       426.67
       2.485     0.998047      1991054       512.00
       2.499     0.998242      1991431       568.89
       2.517     0.998437      1991841       640.00
       2.535     0.998633      1992194       731.43
       2.559     0.998828      1992609       853.33
       2.583     0.999023      1992978      1024.00
       2.597     0.999121      1993171      1137.78
       2.615     0.999219      1993376      1280.00
       2.633     0.999316      1993558      1462.86
       2.655     0.999414      1993767      1706.67
       2.677     0.999512      1993945      2048.00
       2.693     0.999561      1994045      2275.56
       2.705     0.999609      1994140      2560.00
       2.725     0.999658      1994244      2925.71
       2.743     0.999707      1994336      3413.33
       2.771     0.999756      1994435      4096.00
       2.781     0.999780      1994485      4551.11
       2.797     0.999805      1994530      5120.00
       2.813     0.999829      1994584      5851.43
       2.829     0.999854      1994631      6826.67
       2.847     0.999878      1994681      8192.00
       2.859     0.999890      1994701      9102.22
       2.873     0.999902      1994724     10240.00
       2.893     0.999915      1994750     11702.86
       2.905     0.999927      1994772     13653.33
       2.919     0.999939      1994797     16384.00
       2.931     0.999945      1994809     18204.44
       2.957     0.999951      1994822     20480.00
       2.973     0.999957      1994835     23405.71
       2.993     0.999963      1994845     27306.67
       3.015     0.999969      1994858     32768.00
       3.027     0.999973      1994864     36408.89
       3.039     0.999976      1994870     40960.00
       3.065     0.999979      1994876     46811.43
       3.097     0.999982      1994882     54613.33
       3.147     0.999985      1994889     65536.00
       3.155     0.999986      1994892     72817.78
       3.171     0.999988      1994896     81920.00
       3.177     0.999989      1994897     93622.86
       3.209     0.999991      1994900    109226.67
       3.287     0.999992      1994903    131072.00
       3.439     0.999993      1994905    145635.56
       3.485     0.999994      1994906    163840.00
       3.625     0.999995      1994908    187245.71
       3.711     0.999995      1994909    218453.33
       3.729     0.999996      1994911    262144.00
       3.739     0.999997      1994912    291271.11
       3.739     0.999997      1994912    327680.00
       3.767     0.999997      1994913    374491.43
       3.853     0.999998      1994914    436906.67
       3.863     0.999998      1994915    524288.00
       3.863     0.999998      1994915    582542.22
       3.863     0.999998      1994915    655360.00
       3.877     0.999999      1994916    748982.86
       3.877     0.999999      1994916    873813.33
       3.903     0.999999      1994917   1048576.00
       3.903     0.999999      1994917   1165084.44
       3.903     0.999999      1994917   1310720.00
       3.903     0.999999      1994917   1497965.71
       3.903     0.999999      1994917   1747626.67
       3.965     1.000000      1994918   2097152.00
       3.965     1.000000      1994918          inf
#[Mean    =        1.134, StdDeviation   =        0.494]
#[Max     =        3.964, Total count    =      1994918]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2397537 requests in 1.00m, 118.90MB read
Requests/sec:  39959.22
Transfer/sec:      1.98MB