results/data/benchclient1/quarkus-io-thread-47000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.157ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.141ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.145ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.142ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  508.65us   3.96ms   63.24%
    Req/Sec    12.38k   693.69    15.22k    68.98%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09ms
 75.000%    1.51ms
 90.000%    1.83ms
 99.000%    2.31ms
 99.900%    2.70ms
 99.990%    3.04ms
 99.999%    3.30ms
100.000%    3.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.062     0.000000            1         1.00
       0.487     0.100000       235483         1.11
       0.643     0.200000       469403         1.25
       0.788     0.300000       704169         1.43
       0.933     0.400000       937951         1.67
       1.086     0.500000      1173482         2.00
       1.166     0.550000      1290060         2.22
       1.248     0.600000      1406506         2.50
       1.334     0.650000      1524963         2.86
       1.421     0.700000      1641914         3.33
       1.511     0.750000      1759132         4.00
       1.557     0.775000      1817193         4.44
       1.605     0.800000      1875740         5.00
       1.656     0.825000      1934753         5.71
       1.709     0.850000      1992688         6.67
       1.766     0.875000      2051133         8.00
       1.798     0.887500      2081060         8.89
       1.831     0.900000      2109976        10.00
       1.867     0.912500      2139344        11.43
       1.906     0.925000      2168374        13.33
       1.951     0.937500      2198129        16.00
       1.975     0.943750      2212521        17.78
       2.001     0.950000      2227002        20.00
       2.030     0.956250      2241821        22.86
       2.063     0.962500      2256708        26.67
       2.101     0.968750      2271507        32.00
       2.121     0.971875      2278304        35.56
       2.145     0.975000      2285827        40.00
       2.171     0.978125      2293196        45.71
       2.201     0.981250      2300513        53.33
       2.233     0.984375      2307439        64.00
       2.253     0.985938      2311213        71.11
       2.275     0.987500      2314907        80.00
       2.299     0.989062      2318636        91.43
       2.325     0.990625      2322138       106.67
       2.357     0.992188      2325837       128.00
       2.375     0.992969      2327648       142.22
       2.395     0.993750      2329539       160.00
       2.415     0.994531      2331236       182.86
       2.441     0.995313      2333115       213.33
       2.471     0.996094      2334924       256.00
       2.489     0.996484      2335906       284.44
       2.507     0.996875      2336748       320.00
       2.531     0.997266      2337702       365.71
       2.555     0.997656      2338610       426.67
       2.587     0.998047      2339505       512.00
       2.605     0.998242      2339936       568.89
       2.625     0.998437      2340410       640.00
       2.647     0.998633      2340854       731.43
       2.673     0.998828      2341333       853.33
       2.701     0.999023      2341779      1024.00
       2.717     0.999121      2342014      1137.78
       2.735     0.999219      2342231      1280.00
       2.755     0.999316      2342458      1462.86
       2.779     0.999414      2342683      1706.67
       2.809     0.999512      2342911      2048.00
       2.829     0.999561      2343030      2275.56
       2.849     0.999609      2343145      2560.00
       2.875     0.999658      2343263      2925.71
       2.899     0.999707      2343372      3413.33
       2.925     0.999756      2343494      4096.00
       2.939     0.999780      2343540      4551.11
       2.957     0.999805      2343597      5120.00
       2.975     0.999829      2343659      5851.43
       2.991     0.999854      2343711      6826.67
       3.015     0.999878      2343770      8192.00
       3.031     0.999890      2343799      9102.22
       3.047     0.999902      2343829     10240.00
       3.063     0.999915      2343855     11702.86
       3.083     0.999927      2343883     13653.33
       3.105     0.999939      2343911     16384.00
       3.119     0.999945      2343928     18204.44
       3.135     0.999951      2343944     20480.00
       3.147     0.999957      2343954     23405.71
       3.159     0.999963      2343969     27306.67
       3.183     0.999969      2343988     32768.00
       3.185     0.999973      2343990     36408.89
       3.197     0.999976      2343998     40960.00
       3.207     0.999979      2344004     46811.43
       3.225     0.999982      2344012     54613.33
       3.245     0.999985      2344019     65536.00
       3.253     0.999986      2344023     72817.78
       3.271     0.999988      2344026     81920.00
       3.287     0.999989      2344029     93622.86
       3.299     0.999991      2344033    109226.67
       3.315     0.999992      2344037    131072.00
       3.319     0.999993      2344038    145635.56
       3.341     0.999994      2344040    163840.00
       3.371     0.999995      2344043    187245.71
       3.375     0.999995      2344044    218453.33
       3.459     0.999996      2344046    262144.00
       3.459     0.999997      2344046    291271.11
       3.467     0.999997      2344047    327680.00
       3.543     0.999997      2344048    374491.43
       3.609     0.999998      2344049    436906.67
       3.665     0.999998      2344050    524288.00
       3.665     0.999998      2344050    582542.22
       3.673     0.999998      2344051    655360.00
       3.673     0.999999      2344051    748982.86
       3.707     0.999999      2344052    873813.33
       3.707     0.999999      2344052   1048576.00
       3.707     0.999999      2344052   1165084.44
       3.815     0.999999      2344053   1310720.00
       3.815     0.999999      2344053   1497965.71
       3.815     0.999999      2344053   1747626.67
       3.815     1.000000      2344053   2097152.00
       3.815     1.000000      2344053   2330168.89
       3.957     1.000000      2344054   2621440.00
       3.957     1.000000      2344054          inf
#[Mean    =        1.130, StdDeviation   =        0.509]
#[Max     =        3.956, Total count    =      2344054]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2817087 requests in 1.00m, 139.70MB read
Requests/sec:  46952.43
Transfer/sec:      2.33MB